---
kind: method
id: M:Autodesk.Revit.UI.DockablePaneState.Dispose
source: html/68833347-063e-c708-5b6b-c12dec4efc5a.htm
---
# Autodesk.Revit.UI.DockablePaneState.Dispose Method

Releases all resources used by the DockablePaneState

## Syntax (C#)
```csharp
public void Dispose()
```